#! /usr/bin/env python3
import random
import time


nations={'汉族':170,'满族':2,'蒙古族':2,'回族':2,'藏族':2,'维吾尔族':2,'苗族':1,'彝族':1,'壮族':1,'布依族':1,'侗族':1,'瑶族':1,'白族':1,'土家族':1,'哈尼族':1,'哈萨克族':1,'傣族':1,'黎族':1,'傈僳族':1,'佤族':1,'畲族':1,'高山族':1,'拉祜族':1,'水族':1,'东乡族':1,'纳西族':1,'景颇族':1,'柯尔克孜族':1,'土族':1,'达斡尔族':1,'仫佬族':1,'羌族':1,'布朗族':1,'撒拉族':1,'毛南族':1,'仡佬族':1,'锡伯族':1,'阿昌族':1,'普米族':1,'朝鲜族':1,'塔吉克族':1,'怒族':1,'乌孜别克族':1,'俄罗斯族':1,'鄂温克族':1,'德昂族':1,'保安族':1,'裕固族':1,'京族':1,'塔塔尔族':1,'独龙族':1,'鄂伦春族':1,'赫哲族':1,'门巴族':1,'珞巴族':1,'基诺族':1}


def pick_nation():
    value_list = []
    for key, value in nations.items():
         value_list += value*[key]
    pick_value = random.choice(value_list)
    return pick_value
